app/services/admin_bootstrap.rb

SELECT "users".* FROM "users" WHERE "users"."email_address" = 'admin@lendingrails.com' LIMIT 1
---
  def call
    user = User.find_or_initialize_by(email_address: admin_email_address)