app/controllers/passwords_controller.rb

  def create
    if user = User.find_by(email_address: params[:email_address])
---
SELECT "users".* FROM "users" WHERE "users"."email_address" = $1 LIMIT $2  [["email_address", "user1@example.com"], ["LIMIT", 1]]

  def update
    if @user.update(params.permit(:password, :password_confirmation))
---
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "$2a$04$3n1ghPbe0gs5s6VAPzpC5eVUWsJuWC.mEuLrDs1zHqTPp3KdOKRWS"], ["updated_at", "2026-03-30 19:12:05.707457"], ["id", "e0e3ed46-923d-4513-8289-4a8e6365a01f"]]